{"/about":{"title":"About","data":{"":"You are about browsing my personal pages and blog posts.This site not interactable because there are only static pages. That means you are not able leave messages on the pages. But you can reach me via the mail address at the page bottom. If you feel the pages are too simple, yes, it is in propose; if you think the content is incomplete or volatile, it is very possible that I'm editing or playing the application, it maybe fixed after few minutes when you get back.The pages are generated from markdown files and React components, thanks Next.js, a great and funny web application framework."}},"/":{"title":"Profile","data":{"":"","yang-ep#Yang, EP":"I am interested in automate everything, but pilot. Specifically in company, the interesting areas are operation and business processing.I value rational management. Lean does not fit all, but six sigma does. AI is the new standard tool in enterprise planning and optimization.","subjects#Subjects":"","mathematics#Mathematics":"The major in my university was mathematics. In my memory, the curriculums were not very difficult but really boring. In those years, lots of people who study mathematics were led to an abstract way, where the subject was characterized as philosophy, instead of science languate. Read some modern text books wrote by the excellent  scholars, I rebuilt my understanding to mathematics, here are:\nCalculus, James Stewart\nLinear algebra with applications, Steven J.Leon\nProbability and statistics, Morris H. DeGroot\nProbability and Statistics for engineers & scientists, Walpole, Myers, Myers,Ye","economics#Economics":"When I was economics granduate student, one common sense from the professors was economic is not science. There are many so called value investents are speculation natually. But economics should be science. It shares many ideas and approaches with management, such that, risks and management, optimization, time series analysis, games, and so on.","computer#Computer":"I wrote my first BASIC program at 14, I have been computer teacher, IT engineer, programmer. I always keep exciting to compute and following technologies, even though I moved my career focus to management for years and missed many big things like Web 2.0, mobile and Bitcoin. Fortulately, in algorithm and language area, there are so many \"old faces\" that I met many years ago, so that I still can catch the edges of machine learning and programming. The languages I used are:\nBASIC\nFortran\nAssemble\nC\nProgress 4GL\nJava\nJavascript\nPython\nSwift","campaigns#Campaigns":"","digitalization#Digitalization":"","digitalization-transformation#Digitalization transformation":"Transformed operation and management to digitalized, regarding strategy, IT goverence, applications and infrastructure, for a middle scale manufacturer with chemistry, machining and fabric processes.","enterprise-applications#Enterprise applications":"Implemented ERP for Panasonic, Lear, Philips, Henglong, etc.Built data warehouse and OLAP systems for Liwayway and SPP.Developed MES and WMS applications, for example the lean production and logistics system that realized pull and JIS concepts for cockpit assemble lines of Shanghai Volkswagen and Shanghai GM.","excellence#Excellence":"I led some continuously improvement, lean and six-sigma projects in various areas of:\nmanagement\nengineering\nplanning\noperation\ncompliance\n\nThat accross processes:\nsupply network designing\norder processing\nsupply chain planning on demand, S&OP, production, and procurement\noperation scheduling on production, replenishment and distribution\nmaterial handling in warehouse and production line\ntransportation\n\nTo solve problems of:\ndelivery performance\nmaterial supply unstableness\nshipping lane interruption\ntransportation cost\npackaging cost\nspace constraint, etc.","supply-chain-management#Supply chain management":"","supply-chain-establish#Supply chain establish":"Established the end to end supply chain for new products and implemented engineer and capacity changes, for chassis systems(X156, E84, 212, etc) of BMW, Mercedes and Audi; and for varity of bearings.","logistics-system-setup#Logistics system setup":"Setup the logistics system consists of warehouse, facilities, processes, and systems for ZF Chennai plant, Schaeffler Taicang campus logistics hub.","post-acquization-integration#Post acquization integration":"Integrated the supply chain of the acquized Samsung and AFOP product lines in sites of South Korea, Taipei and Shenzheng.","function-building#Function building":"Formed the Asia region logistics function, which covers India, Taiwan, South Korea, and China plants. The governance archtecture and management foundation were created from ground.","career-footprint#Career footprint":"Zhejiang Industry School, computer teacherPanasonic, IT engineerAtos Origin, consultant of enterprise solutionSchaeffler, senior supply chain managerZF, China logistics headCorning, Asia logistics head","learning#Learning":"The disciplines I learnt are broad, among most out of classroom. Those official ones are:\nEconomic, Renmin University of China\nMathematics, East China Normal University\nMathematics, Sichuan Normal University\nSix sigma black belt, ASQ\nCPIM, APICS\nPMP, PMI\nSCJD and MCSE(yes, I was! )"}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}}}