{"/":{"title":"About","data":{"":"","yang-ep#Yang, EP":"","professional-footprint#Professional footprint":"Computer teacher, at Zhejiang Industry SchoolIT engineer, at PanasonicConsultant, at Atos OriginSenior supply chain manager, at SchaefflerChina logistics head, at ZFAsia logistics head, at Corning","projects#Projects":"","supply-chain-launching#Supply chain launching":"Launched the end to end supply chain for new products those include chassis systems of Mercedes X156 and 212, BMW E84, and Volkswagen double clutch.","logistics-system-establishment#Logistics system establishment":"Established the logistics system of the ZF Malaysia Penang plant, and campus logistics system which integrated from Schaeffler Taicang plants. Implemented the capacity and engineering changes to various production lines.","function-building#Function building":"Formed the logistics function of ZF Malaysia Penang plant. Developed the Asia reginal logistics governance archtecture and management system from ground;","post-acquisition-integration#Post acquisition integration":"Integrated the supply chain of Samsung South Korea and AFOP Taipei and Shenzheng plants into Corning.","digitalization-transformation#Digitalization transformation":"Transformed operation and management to digital, regarding 5-years strategy, IT goverence, applications and infrastructure, for Felihua.","enterprise-applications-implementation#Enterprise applications implementation":"Deliveried ERP for Panasonic, Lear, Philips, Henglong, etc.Developed data warehouse and deployed OLAP repository and application for Liwayway and SPP.Developed MES and WMS for various manufacturers, for example the lean production and logistics system that realized pull and JIS concepts for cockpit assemble lines of Shanghai Volkswagen and Shanghai GM.","excellence#Excellence":"There were various problems I encountered in business, such as:\ndelivery failure\nmaterial supply interruption\ntransportation crisis\npackaging and transportation cost\ninventory level\ncapacity constraint, etc.\n\nI initialed and led many continuously improvement, lean and six-sigma projects in areas of management, planning, operation and compliance. Improved processes of:\ncapacity planning\ndemand planning, S&OP\nproduction planning and scheduling\nmaterial planning\norder processing\nprocurement\nreplenishment\ndistribution\ntransportation\npackaging\nimport and export","expertise#Expertise":"Supply chain and logisticsLean and six sigmaMachine learningComputer","education#Education":"Mathematics, Sichuan Normal UniversityMathematics, East China Normal UniversityEconomic, Renmin University of China"}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}},"/gallery":{"title":"Gallery","data":{"":"","man-in-the-mirror#Man in the mirror":""}}}