{"/profile":{"title":"Profile","data":{"":"","major#Major":"","mathematics#Mathematics":"My initial major is mathematics in Sichuan Normal University since 1992 to 1996. The curriculums were not very difficult but really boring. In those years, lots of people who study mathematics were led to an abstract way, which characterizes mathematics as thinking, instead of science. Learned from the modern text books wrote by the excellent American and yound Chinese scholars, I rebuilt my understanding to mathematics thinking and application.","economics#Economics":"I studied economics in Renmin University of China during 2012 and 2016. As the teachers said, economic is not science. Investmentors aim to value, but most so called investments are natually speculation. Risk management is the real core. My finance knowledge never made me rich, but the interesting point is, from the micro point of view, economics shares many research approaches and analysis technologies with management.","computer#Computer":"Since I wrote my first BASIC program at 14, computer has been exciting me for decades by its infinite possiblities and wide varity of application. Perhaps argorithm is a special area from hardware, software archtecture and programming language. The common algorithms are still \"old\" since I teached the Data Structure course in 1996, as well as the algorithms of machine learning, neural network, reforce learning and linear programming. I moved my focus to management and supply chain for years, but I still keep following the technologies for enterprise, mobile and artificial intelligence. I favor C, Java and JavaScript among the expanding languages.","experience#Experience":"","digitalization#Digitalization":"In the early digitalization wave in China, I worked as inhouse IT engineer for Panasonic and consultant for Atos Origin for about 10 years since 1999, delivered business and operation management solutions for several lead companies from automotive, machinery and electronic industries, e.g. Delphi, Lear, Philips, etc. The examples are:\nERP implementation, the software were from QAD\nMES and LES development and implementation, the applications were customized\nBI, the software were from Business Objects\n\nSince 2018, I moved my eyes back to IT when the background changed to Industry 4.0. I worked on digitalization transformation for a growing middle scale manufacturer, meanwhile improving supply chain and production excellence. The strategic object is achieving high maturity level of management and operation, the way is digitalization, intelligentize and automotion. Along the roadmap, APS, SCADA, MES and BI applications were implemented or improved, meanwhile, the IT governance systems is established.","excellence#Excellence":"Continuously improving output quality and efficiency is my regular responsibility as a manager. The operation were regularly reviewed against expection, analyse the value stream, finding problems and improvement potentials, place actions. The scope covers all areas that influence customer satisfaction. Some examples:\nTransportation milkrun\nReturnable packaging\nSupermarket, Kanban, and JIT\nSequencing delivery\nAdvanced scheduling\n\nThere are lots of methods and tools. Some frequently used in my work are:\nValue stream mapping and analysis\nQuality tools\nLean processes and methods\nStatistics analysis\nLinear programming and machine learning\n\nOne lesson I learned is don't be rigid by \"standard\" process and tools. I led a project to solve product delivery problem of low performance, high damage and wrong. It caused considerable external quality cost and customer complain. I leveraged quality planning approach that origin from APQP and some other process control methods. The delivery reliability achieved 100% after 6 months, the quality cost reduced to 0. However this project was challaged that it did not follow the full cycle DMAIC process and there is not beautiful diagrams and statistics analysis.When we are talking business analysis, we should be careful to using technologies:\nsimple prefer over complex\nmachine learning prefer over deep learning\nstatistics characterize whole instead of individuals, we must drill down after statistics analysis\nconsider sample size and i.i.d. assumption to use statistics methods","management#Management":"I have been department head of IT, supply chain, and logistics functions, in plant, China, or Asia region scope.On behalf of project manager, I led variety of projects, for example process revolution, logistics network programming, post acquization integration, IT applications, and so on. I have been PMO head to oversee the portfolios of dozens of excellence and new product launching.","footprint#Footprint":"Technical school, Computer and mathematics teacher, 1996 - 1999Panasonic, IT engineer and supervisor, 1999 - 2003Atos Origin, Consultant, 2003 - 2010Schaeffler, Senior Supply Chain Manager, 2010 - 2013ZF, China Logistics Head, 2013 - 2015Corning, Asia Logistics Head, 2015 - 2017Feilihua, Consultant, 2017 - 2022"}},"/":{"title":"About","data":{"":"You are about browsing EP Yang's personal pages and blog posts.This site not interactable because there are only static pages. That means you are not able leave messages on the pages. But you can reach me via the mail address at the page bottom. If you feel the pages are too simple, yes, it is in propose; if you think the content is incomplete or volatile, it is very possible that I'm editing or playing the application, please get back soon later!The pages are generated from markdown files and React components, thanks Next.js, a great and funny web application framework."}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}}}