{"/":{"title":"Profile","data":{"":"","yang-ep#Yang, EP":"","subjects#Subjects":"","mathematics#Mathematics":"My initial major is mathematics in Sichuan Normal University since 1992 to 1996. The curriculums were not very difficult but really boring. In those years, lots of people who study mathematics were led to an abstract way, which characterizes mathematics as minding, instead of science. Learned from the modern text books wrote by the excellent American and yound Chinese scholars, I rebuilt my understanding to mathematics thinking and application.","economics#Economics":"I studied economics in Renmin University of China during 2012 and 2016. As the teachers said, economic is not science. Investmentors aim to value, but most so called investments are natually speculation. Risk management is the real core. My finance knowledge never made me rich, but the interesting point is, from the micro point of view, economics shares many research approaches and analysis technologies with management.","computer#Computer":"Since I wrote my first BASIC program at 14, computer has been exciting me for decades by its infinite possiblities and wide varity of application. Perhaps argorithm is a special area from hardware, software archtecture and programming language. The common algorithms are still \"old\" since I teached the Data Structure course in 1996, as well as the algorithms of machine learning, neural network, reforce learning and linear programming. I moved my focus to management and supply chain for years, but I still keep following the technologies for enterprise, mobile and artificial intelligence. I favor C, Java and JavaScript among the expanding languages.","campaigns#Campaigns":"","digitalization#Digitalization":"","digitalization-transformation#Digitalization transformation":"Digitalize product development, production and management for a manufacturer with chemestry, maching and fabrics processes. Formulated digitalization strategy, transformed IT organization, changed the business processes, implemented SCADA, MES, ERP, BI and workflow applications.","applications#Applications":"Delivered ERP applications along with business process improvement on supply chain, manufacturing and finance management for various automotive, machinery, electronic companies.Developed the manufacture execution and logistics application that realized lean concepts of pull and just in sequence, implemented for cockpit module lines of Shanghai Volkswagen and Shanghai GM.","business-intellegence#Business intellegence":"Delivered the data warehouse and OLAP system for SPP.","supply-chain-and-logistics#Supply chain and logistics":"","new-product-launch#New product launch":"Made supply chain ready for various chassis system projects (X156, C212, E84, etc.) of BMW, Mercedes, and Audi; double clutch project of Volkswagen.","production-system#Production system":"Realized production system of new products and implemented customer changes jointly with ZF production engineering department. The logistics elements are floor layout, line feeding system, racks, packaging, replenishment and transportation, scheduling, etc.","excellence#Excellence":"I led many of six-sigma, lean and continuous improvement projects, below brief several examples:\nCustomer delivery failure prevent, Corning Chengdu plant.\nMaterial supply recovery, Corning Haikou plant.\nTransportation cost reduction, Corning OC Asia.\nInventory reduction, ZF Beijing plant.\nMaterial packaging cost reduction, ZF Beijing plant.\n...","management#Management":"","post-acquization-integration#Post acquization integration":"I led the project to integrate the supply chain of Samsung fiber cable business unit which include two manufacture sites in South Korea and Haikou due to acquization. The work regarding customer orders, supply network, logistics service providers, and organization.Another post acquization integration project was for AFOP whose production sites were in Taipei and Dongguan.","logistics-function-establish#Logistics function establish":"I formed Corning OC Asia region logistics function, which covers India, Taiwan, South Korea, and China plants. The governance archtecture and management foundation where created from ground.","business-process-revolution#Business process revolution":"Due to the organization and management system changing, Schaeffler Greater China supply chain management processes were reviewed, the process landscape of OEM and catalog, after market business units was updated, the processes were optimized as needed. The new processes were re-implemented with applications.","career-footprint#Career footprint":"Zhejiang Industry School, Computer teacher\nPanasonic, IT engineer\nAtos Origin, Consultant of enterprise solution\nSchaeffler, Senior Supply Chain Manager\nZF, China Logistics Head\nCorning, Asia Logistics Head","interesting#Interesting":"Automatic operation.\nAI with six-sigma and supply chain management."}},"/about":{"title":"About","data":{"":"You are about browsing my personal pages and blog posts.This site not interactable because there are only static pages. That means you are not able leave messages on the pages. But you can reach me via the mail address at the page bottom. If you feel the pages are too simple, yes, it is in propose; if you think the content is incomplete or volatile, it is very possible that I'm editing or playing the application, it maybe fixed after few minutes when you get back.The pages are generated from markdown files and React components, thanks Next.js, a great and funny web application framework."}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}}}